from models.category import Category
from utils.database import SessionLocal


def run():
    db = SessionLocal()

    data = [
        {
            "name": "Строительство",
            "subcategories": [
                "Каменщик",
                "Плотник",
                "Арматурщик",
                "Монтажник",
                "Отделочник",
                "Электрик",
                "Сантехник",
                "Разнорабочий"
            ]
        },
        {
            "name": "Производство",
            "subcategories": [
                "Оператор станков",
                "Фасовщик",
                "Упаковщик",
                "Контроль качества",
                "Сборщик",
                "Швея",
                "Работник пищевого производства"
            ]
        },
        {
            "name": "Сельское хозяйство",
            "subcategories": [
                "Сборщик фруктов и овощей",
                "Работник теплицы",
                "Работа на ферме",
                "Упаковщик продукции",
                "Уход за животными"
            ]
        },
        {
            "name": "Склад и логистика",
            "subcategories": [
                "Грузчик",
                "Комплектовщик",
                "Кладовщик",
                "Водитель погрузчика",
                "Водитель категории B/C/E",
                "Курьер"
            ]
        },
        {
            "name": "Отели и гостиницы",
            "subcategories": [
                "Горничная",
                "Уборщица",
                "Прачка",
                "Администратор ресепшн",
                "Консьерж",
                "Менеджер отеля",
                "Обслуживание номеров",
                "Ночной портье",
                "Техник по обслуживанию",
                "Электрик",
                "Сантехник",
                "Хозяйственник",
                "Аниматор",
                "Массажист / SPA-мастер",
                "Бассейн-ассистент"
            ]
        },
        {
            "name": "Общественное питание",
            "subcategories": [
                "Повар",
                "Помощник повара",
                "Кондитер",
                "Пекарь",
                "Официант",
                "Бармен",
                "Мойщик посуды",
                "Кухонный рабочий",
                "Кассир"
            ]
        },
        {
            "name": "Уборка и клининг",
            "subcategories": [
                "Уборщица",
                "Клинер",
                "Домработница",
                "Хозяйственник"
            ]
        },
        {
            "name": "Медицина и уход",
            "subcategories": [
                "Сиделка",
                "Санитар",
                "Медсестра",
                "Уход за пожилыми",
                "Домашний помощник"
            ]
        },
        {
            "name": "Авто и ремонт",
            "subcategories": [
                "Автомеханик",
                "Автомаляр",
                "Автоэлектрик",
                "Слесарь",
                "Электронщик"
            ]
        },
        {
            "name": "Охрана и безопасность",
            "subcategories": [
                "Охранник",
                "Консьерж",
                "Контролер"
            ]
        },
        {
            "name": "Другое",
            "subcategories": [
                "Оператор call-центра",
                "Менеджер",
                "Работник без квалификации"
            ]
        }
    ]

    for category in data:
        item = Category(title=category['name'])
        db.add(item)
        db.flush()

        for sc in category['subcategories']:
            db.add(Category(parent_id=item.id, title=sc))

    db.commit()
    db.close()


if __name__ == '__main__':
    run()
